In [1]:
#data frame we are working with the astype()

In [19]:
import pandas as pd
import numpy as np
a={'fee':["10,20,30,40"],'discount':["100,200,300,400"]}
print(a)

{'fee': ['10,20,30,40'], 'discount': ['100,200,300,400']}

In [47]:
# Create DataFrame from Dictionary
import numpy as np
import pandas as pd
technologies = {'Fee' :["20000","25000","26000"],'Discount':["1000","2300","1500"]  }
df = pd.DataFrame(technologies)
print(df)

     Fee Discount
0  20000     1000
1  25000     2300
2  26000     1500

In [49]:
df.astype(np.int64)

     Fee  Discount
0  20000      1000
1  25000      2300
2  26000      1500

In [51]:
print(df)

     Fee Discount
0  20000     1000
1  25000     2300
2  26000     1500

In [53]:
# Create DataFrame from Dictionary
import numpy as np
import pandas as pd
technologies = {'Fee' :["20000","25000","26000"],'Discount':["1000","2300","1500"]  }
df = pd.DataFrame(technologies)
print(df)
df.astype(float)

     Fee Discount
0  20000     1000
1  25000     2300
2  26000     1500

       Fee  Discount
0  20000.0    1000.0
1  25000.0    2300.0
2  26000.0    1500.0

In [55]:
# Create DataFrame from Dictionary
import numpy as np
import pandas as pd
technologies = {'Fee' :["20000","25000","26000"],'Discount':["1000","2300","1500"]  }
df = pd.DataFrame(technologies)
print(df)
df.astype('str')

     Fee Discount
0  20000     1000
1  25000     2300
2  26000     1500

     Fee Discount
0  20000     1000
1  25000     2300
2  26000     1500

In [57]:
technologies = {'Courses':["Spark","PySpark","Hadoop"],
    'Fee' :["20000","25000","26000"],
    'Duration':['30day','40days','35days'],
    'Discount':["1000","2300","1500"]
              }
df = pd.DataFrame(technologies)
print("------------------------------------------")
print(df)
print("------------------------------------------")
print(df.dtypes)

------------------------------------------
   Courses    Fee Duration Discount
0    Spark  20000    30day     1000
1  PySpark  25000   40days     2300
2   Hadoop  26000   35days     1500
------------------------------------------
Courses     object
Fee         object
Duration    object
Discount    object
dtype: object

In [59]:
df.astype({'Courses':'str','Fee':int,'Duration':'str','Discount':float})

   Courses    Fee Duration  Discount
0    Spark  20000    30day    1000.0
1  PySpark  25000   40days    2300.0
2   Hadoop  26000   35days    1500.0

In [63]:
s1=df.Courses.astype(int,errors='ignore')
pr

0      Spark
1    PySpark
2     Hadoop
Name: Courses, dtype: object